# Напишите программу, которая считывает два целых числа A и B и выводит наибольшее значение из них.
import math

a = int(input())
b = int(input())
print(max(a, b))
